import './Rewards.css';

const Rewards = () => {
  return (
    <div className="rewards-page">
        <div className="rewards">
            <div className="rewards__header">
                <h1 className="rewards__title">Награды</h1>
                <p className="rewards__description">Ваши достижения и трофеи</p>
            </div>

            <div className="rewards__content">
                <div className="rewards__list">
                    <div className="rewards__card">
                        <div className="rewards__card-header">
                            <div className="rewards__icon">
                                <svg width="19" height="19" viewBox="0 0 19 19" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path d="M15 6.66667L13.9583 4.375L11.6667 3.33333L13.9583 2.29167L15 0L16.0417 2.29167L18.3333 3.33333L16.0417 4.375L15 6.66667V6.66667M15 18.3333L13.9583 16.0417L11.6667 15L13.9583 13.9583L15 11.6667L16.0417 13.9583L18.3333 15L16.0417 16.0417L15 18.3333V18.3333M6.66667 15.8333L4.58333 11.25L0 9.16667L4.58333 7.08333L6.66667 2.5L8.75 7.08333L13.3333 9.16667L8.75 11.25L6.66667 15.8333V15.8333M6.66667 11.7917L7.5 10L9.29167 9.16667L7.5 8.33333L6.66667 6.54167L5.83333 8.33333L4.04167 9.16667L5.83333 10L6.66667 11.7917V11.7917M6.66667 9.16667V9.16667V9.16667V9.16667V9.16667V9.16667V9.16667V9.16667V9.16667V9.16667" fill="currentColor" />
                                </svg>
                            </div>
                            <div className="rewards__status">
                                <svg width="12" height="12" viewBox="0 0 12 12" fill="none" xmlns="http://www.w3.org/2000/svg" >
                                    <path d="M5.01667 8.51667L9.12917 4.40417L8.3125 3.5875L5.01667 6.88333L3.35417 5.22083L2.5375 6.0375L5.01667 8.51667V8.51667M5.83333 11.6667C5.02639 11.6667 4.26806 11.5135 3.55833 11.2073C2.84861 10.901 2.23125 10.4854 1.70625 9.96042C1.18125 9.43542 0.765625 8.81806 0.459375 8.10833C0.153125 7.39861 0 6.64028 0 5.83333C0 5.02639 0.153125 4.26806 0.459375 3.55833C0.765625 2.84861 1.18125 2.23125 1.70625 1.70625C2.23125 1.18125 2.84861 0.765625 3.55833 0.459375C4.26806 0.153125 5.02639 0 5.83333 0C6.64028 0 7.39861 0.153125 8.10833 0.459375C8.81806 0.765625 9.43542 1.18125 9.96042 1.70625C10.4854 2.23125 10.901 2.84861 11.2073 3.55833C11.5135 4.26806 11.6667 5.02639 11.6667 5.83333C11.6667 6.64028 11.5135 7.39861 11.2073 8.10833C10.901 8.81806 10.4854 9.43542 9.96042 9.96042C9.43542 10.4854 8.81806 10.901 8.10833 11.2073C7.39861 11.5135 6.64028 11.6667 5.83333 11.6667V11.6667" fill="currentColor" />
                                </svg>
                                Получено
                            </div>
                        </div>
                        
                        <div className="rewards__card-info">
                            <h2 className="rewards__card-title">Первые шаги</h2>
                            <p className="rewards__card-description">
                                Получите свое первое яйцо.
                            </p>
                        </div>

                        <div className="rewards__card-fill"></div>
                    </div>
                </div>
            </div>
        </div>
    </div>
  );
};

export default Rewards;